import newsImg1 from "../../../public/images/news/news-img.jpg";
import newsImg2 from "../../../public/images/news/news-img-2.jpg";

export const defaultNews = [
  {
    id: 1,
    title: "Հրետանու ֆակուլտետի վերանորոգված մասնաշենքի բացման արարողությունը",
    description:
      "Հոկտեմբերի 19֊ին ՀՀ ՊՆ Վ.Սարգսյանի անվան ռազմական ակադեմիայում տեղի է ունեցել հրետանու ֆակուլտետի` մասնագիտական լսարաններով կահավորված, հիմնանորոգված մասնաշենքի բացման արարողությունը։",
    date: "2023/09/19",
    image: newsImg1
  },
  {
    id: 2,
    title: "Առաջին կուրսեցիների ընդունելություն",
    description: `Օգոստոսի 27-ը հիշարժան օր էր Ռազմական ակադեմիայի առաջին կուրսեցիների համար:
    Ապագա սպաները համալսարանի Մարտական դրոշի ներքո երդվեցին անձնվիրաբար ծառայել հայրենիքին և բարձր պահել հայոց բանակի պատիվը։
    Կուրսանտներին ընդունվելու և նման պատասխանատու և պատվաբեր մասնագիտություն ընտրելու կապակցությամբ շնորհավորեցին Ռազմական ակադեմիայի պետ, գնդապետ Ա.Երոյանը և պաշտպանության նախարարի օգնական Հ.Մաթևոսյանը։`,
    date: "2023/08/27",
    image: newsImg2
  },
  {
    id: 3,
    title: "Տեխնոլոգիական և ռազմական կրթության համատեղմամբ",
    description:
      "ՀՀ ՊՆ Վազգեն Սարգսյանի անվան ռազմական ակադեմիայի տարածքում բացվել են Թումո տուփեր։ Ռազմական ակադեմիայի կուրսանտները տեխնոլոգիական կրթություն են ստանում հատուկ մշակված մոդուլով, որը միավորում է Թումոյի ծրագիրը և համալսարանի տեխնոլոգիական կրթության բաղադրիչը։",
    date: "2023/09/30",
    image: newsImg1
  },
  {
    id: 4,
    title: "Այց դեպի Իտալիա",
    description: `Սեպտեմբերի 26֊ից 29 ՀՀ ՊՆ Վ. Սարգսյանի անվան ռազմական ակադեմիայի պետ, գնդապետ Արթուր Երոյանի գլխավորած պատվիրակությունը ճանաչողական այցով գտնվել է Իտալիայում։ Այցի շրջանակներում ՀՀ ՊՆ պատվիրակությունը այցելել է Մոդենայի ռազմական ակադեմիա և Թուրինի դիմորդների դպրոց, որտեղ հանդիպել է կրթօջախների ղեկավարությանը և աշխատակազմին։ Իտալական կողմը ներկայացրել է ռազմական ուսումնական հաստատությունների ուսումնական գործընթացը, կիրառվող դասավանդման մեթոդները, ինչպես նաև վարժական, կրթական և սպորտային կենտրոնները։ Իտալիա այցի շրջանակներում քննարկվել են նաև երկու երկրների ռազմական կրթօջախների միջև համագործակցության ընդլայնման հեռանկարները։`,
    date: "2023/08/26",
    image: newsImg2
  }
];
