interface General {
  name: string;
  date: string;
  image?: string;
}

export const generals: General[] = [
  {
    name: "Գնդապետ Արթուր Ներսեսի Երոյան",
    date: "2021"
  },
  {
    name: "Գնդապետ Խաչատուր Թորոսի Խաչատրյան",
    date: "2019-2021"
  },
  {
    name: "Գեներալ-մայոր Արմեն Բախշիի Ղահրամանյան",
    date: "2015-2019"
  },
  {
    name: "Գեներալ-լեյտենանտ Մարտին Նազարի Կարապետյան",
    date: "2008-2015"
  },
  {
    name: "Գեներալ-լեյտենանտ Գարեգին Աշոտի Գաբրիելյան",
    date: "2007-2008"
  },
  {
    name: "Գեներալ-լեյտենանտ Ստեփան Վահանի Միրզոյան",
    date: "2000-2007"
  },
  {
    name: "Գեներալ-լեյտենանտ Արշալույս Զավենի Փայտյան",
    date: "1998-2000"
  },
  {
    name: "Գեներալ-մայոր Աշոտ Սեդրակի Պետրոսյան",
    date: "1997-1998"
  },
  {
    name: "Փոխգնդապետ Ալեքսան Գրիգորի Մինասյան",
    date: "1997"
  },
  {
    name: "Գեներալ-մայոր Սերգեյ Սահակի Մարտիրոսյան",
    date: "1994-1997"
  }
];
