import { IMilEducation } from "./data";

export const faq: IMilEducation[] = [
  {
    title: "Ո՞ր տարիքից կարող եմ ընդունվել Ռազմական համալսարան",
    content:
      "Ռազմական համալսարան ընդունվում են միջնակարգ (լրիվ) ուսումն ավարտելուց հետո, իսկ դիմորդների առավելագույն տարիքը 23 տարեկանն է:"
  },
  {
    title: "Պատիվ ունեմ",
    content:
      "«Պատիվ ունեմ» ծրագրին ծանոթանալու համար, կարող եք ուսումնասիրել հետևյալ փաստաթուղթը։ <a download href='https://drive.google.com/file/d/1vVHBJuGPO8oGSr4nI_Uzh3RM_Cf41ba8/view?usp=sharing'>Պատիվ ունեմ</a>"
  },
  {
    title: "Քանի՞ տարի է կրթությունը",
    content: `Կրթությունը 4 տարի է, որի ավարտին շրջանավարտները ձեռք են բերում բալակավրի որակավորում:<br/>
    Ունենք նաև լրացուցիչ կրթության դասընթացներ քաղաքացիական բուհ ավարտած ՀՀ ԶՈՒ ենթասպայական և պայմանագրային կազմի համար: <br />
    Կրթության ավարտին մեր կուրսանտները ձեռք են բերում բակալավրի որակավորում և, ստանալով լեյտենանտի սպայական կոչում, վիճակահանության սկզբունքով նշանակվում են համապատասխան սպայական պաշտոնների։`
  },
  {
    title: "Ինչպե՞ս կարող եմ մասնակցել ընդունելությանը",
    content: `Ընդունելությանը մասնակցելու համար պետք է մոտենաք ՀՀ ՊՆ զորակորչային և զորահավաքային համալրման ծառայության տարածքային ստորաբաժանումները (նախկինում՝ զինկոմիսարիատ)՝ անհրաժեշտ փաստաթղթերը ձևակերպելու համար։<br />
    Բուհերի ընդունելության հայտերը լրացնելու ժամանակ, պետք է ՀՀ ՊՆ զորակորչային և զորահավաքային համալրման ծառայության տարածքային ստորաբաժանումներում (նախկինում՝ զինկոմիսարիատ) գրեք դիմում, որ ցանկանում եք սովորել ՀՀ ՊՆ Վ.Սարգսյանի անվան ռազմական համալսարանում, որից հետո Ձեզ կտեղեկացնեն ինչ փաստաթղթեր են անհրաժեշտ:`
  },
  {
    title: "Ի՞նչ մասնագիտությամբ կարող եմ սովորել",
    list: [
      {
        listTitle: "Ռազմական համալսարանում առկա են հետևյալ մասնագիտությունները՝",
        listItems: [
          "մոտոհրաձգային ստորաբաժանումների կառավարում,",
          "հրետանային ստորաբաժանումների կառավարում,",
          "հետախուզական ստորաբաժանումների կառավարում,",
          "ինժեներասակրավորային ստորաբաժանումների կառավարում,",
          "տանկային ստորաբաժանումների կառավարում,",
          "հատուկ նշանակության ստորաբաժանումների կառավարում:"
        ]
      }
    ]
  },
  {
    title: "Ի՞նչ քննություններ պետք է հանձնել Ռազմական համալսարան ընդունվելու համար:",
    content: `Դիմորդները «Մաթեմատիկա» և «Ֆիզիկա» առարկաների քննությունները հանձնում են միասնական քննությունների «Բ» տարբերակով, իսկ «Հայոց լեզու» առարկայի քննությունը՝ ավարտական քննությունների «Ա» տարբերակով։<br />
    Առողջական վիճակի մասին ռազմաբժշկական հանձնաժողովի դրական եզրակացության դեպքում թույլատրվում է մասնակցել «Ֆիզիկական պատրաստություն» առարկայի քննությանը:<br />
    «Ֆիզիկական պատրաստություն» առարկայից արական սեռի դիմորդները քննություն են հանձնում «ձգումներ պտտաձողի վրա» (իգական սեռի դիմորդները՝ «համալիր ուժային վարժություն»), «վազք 100մ» և «վազք 1000մ» վարժաձևերից:`
  },
  {
    title: "Ընդունելության քննություններ",
    content:
      "Ռազմական համալսարանում անցկացվող քննությունների մասին լրացուցիչ կտեղեկացնեն ՀՀ ՊՆ զորակորչային և զորահավաքային համալրման ծառայության տարածքային ստորաբաժանումները (նախկինում՝ զինկոմիսարիատ): Իսկ «Ֆիզիկա» և «Մաթեմատիկա» առարկաների միասնական քննությունների վերաբերյալ տեղեկություն ստանալու համար կարող եք դիմել ԿԳՄՍ նախարարություն:"
  },
  {
    title: "Որքա՞ն է ուսման վարձը",
    content: "Ռազմական համալսարանում կրթությունն անվճար է:"
  },
  {
    title: "Կուրսանտների արտոնությունները",
    content:
      "Համալսարանի կուրսանտներն ապահովվում են անվճար սննդով, հանդերձանքով և կացարանով, ամենամյա արձակուրդով՝ 4 շաբաթ ամռանը և 2 շաբաթ ձմռանը:"
  },
  {
    title: "Ինչպե՞ս կարող եմ վերականգնել պատերազմում կորցրած փաստաթղթերս",
    content:
      "Ռազմական համալսարանի պետի անունով պետք է գրեք զեկուցագիր՝ կորցրած վկայականը/դիպլոմը և դրա միջուկը վերականգնելու վերաբերյալ` դրան կցելով նաև վկայականի և միջուկի պատճենները:"
  },
  {
    title: "1-ամյա սպայական դասընթացների մասին",
    content:
      "Ունենք լրացուցիչ կրթության 1-ամյա սպայական դասընթացներ՝ քաղաքացիական բուհերի շրջանավարտների համար: Դիմորդների հավաքագրումն իրականացվում է մեր մասնագետի կողմից, ով գտնվում է կենտրոնական հավաքակայանում:"
  },
  {
    title: "Նվազագույն ծառայությունը, ուսումը ավարտելուց հետո",
    content:
      "Ավարտելուց հետո ծառայությունը նվազագույնը 10 տարի է, սակայն եթե ուզում եք ստանալ զինվորական կենսաթոշակ՝ 20 տարի (կրթությունը ներառյալ)։"
  },
  {
    title: "Ժամկետային զինծառայության մասին",
    content: `Բանակի համար հաշվառման կանգնելը չի խանգարի մեր բուհ ընդունվելու համար: Դպրոցն ավարտելուց հետո, բուհերի ընդունելության հայտեր ներկայացնելու ժամանակ, պետք է դիմեք Ձեր տարածքային զինկոմիսարիատ՝ անհրաժեշտ փաստաթղթերը ձևակերպելու համար: <br />
    Եթե Ռազմական համալսարանն ավարտելուց հետո շարունակելու եք ծառայությունը ՀՀ Զինված ուժերում, ապա համարվում է, որ անցել եք ժամկետային ծառայությունը, հակառակ դեպքում՝ ոչ:`
  },
  {
    title: "Թափուր հաստիքների վերաբերյալ",
    content:
      "Թափուր հաստիքների մրցույթների մասին տեղեկատվություն կարող եք ստանալ <a href='http://www.hayzinvor.am/cat/news' download>«Հայ Զինվոր»</a> պարբերականից:"
  },
  {
    title: "Վերապատրաստումներ և դասընթացներ ՌՀ-ում",
    content: `Ռազմական համալսարանում վերապատրաստվում են միայն ՀՀ Զինված ուժերի զինծառայողները: <br />
    Այդ դասընթացների վերաբերյալ պարբերաբար լինում են ՊՆ հրամաններ: Կարող եք դիմել Ձեր հրամանատարությանը՝ նշելով, որ ցանկանում եք մասնակցել նման դասընթացների:`
  }
];
