// types
import { StaticImageData } from "next/image";

// images
import NewsThumbnail from "@images/NewsThumbnail.png";
import AboutNews1 from "@images/AboutNews1.png";
import AboutNews2 from "@images/AboutNews2.png";
import AboutNews3 from "@images/AboutNews3.png";
import AboutNews4 from "@images/AboutNews4.png";
import MainPartImage1 from "@images/MainPartImage1.png";
import MainPartImage2 from "@images/MainPartImage2.jpg";
import MainPartImage3 from "@images/MainPartImage3.jpg";

export interface IAboutNewsData {
  image1: StaticImageData;
  image2: StaticImageData;
}

export interface IMainPartData {
  image: StaticImageData;
  title: string;
  path: string;
}

interface List {
  info?: string;
  listTitle?: string;
  listItems: string[];
  footer?: string;
  listType?: "ordered" | "unordered";
}

export interface IMilEducation {
  title: string;
  content?: string;
  list?: List[];
}

export const AboutNewsData: IAboutNewsData[] = [
  {
    image1: AboutNews1,
    image2: AboutNews2
  },
  {
    image1: AboutNews4,
    image2: AboutNews3
  }
];

export const MainPartsData: IMainPartData[] = [
  {
    image: MainPartImage1,
    title: "Ցամաքային զորքերի ինստիտուտ",
    path: "/about_us?part=structure"
  },
  {
    image: MainPartImage2,
    title: "Ռազմաօդային զորքերի ինստիտուտ",
    path: "/about_us?part=structure"
  },
  {
    image: MainPartImage3,
    title: "Հրամանատարաշտաբային ֆակուլտետ",
    path: "/about_us?part=structure"
  }
];

export const milEducation: IMilEducation[] = [
  {
    title: "Հնգամյա Սպայական Դասեր",
    list: [
      {
        info: "Հինգամսյա սպայական դասընթացներ՝ բարձրագույն ուսումնական հաստատություններն ավարտած, զինված ուժերի ենթասպայական և պայմանագրային կազմի համար:",
        listTitle: "Մասնագիտությունները՝",
        listItems: [
          "մոտոհրաձգային ստորաբաժանումների կառավարում,",
          "հրետանային ստորաբաժանումների կառավարում,",
          "տանկային ստորաբաժանումների կառավարում:"
        ],
        footer: "<strong>Ուսման տևողությունը</strong> հինգ ամիս է, անվճար:"
      }
    ]
  },
  {
    title: "Մեկամյա սպայական դասընթացներ",
    list: [
      {
        info: "Մեկամյա սպայական դասընթացներ՝ քաղաքացիական բուհերի շրջանավարտների համար:",
        listTitle: "Մասնագիտությունները՝",
        listItems: ["մոտոհրաձգային ստորաբաժանումների կառավարում,", "հրետանային ստորաբաժանումների կառավարում,"],
        footer: "<strong>Ուսման տևողությունը</strong> 1 տարի է, անվճար:"
      }
    ]
  },
  {
    title: "Ռազմական Կրթություն։ Լրացուցիչ ինֆորմացիա",
    content: `Ուսումնական գործընթացի պլանավորման եւ կազմակերպման վերաբերյալ մանրամասներ։ <a download href='https://drive.google.com/file/d/1bTksAVfkk4ZnDhwA1gtC8Bbe7sdtb87M/view' target="_blank">Լրացուցիչ ինֆորմացիա</a>`
  },
  {
    title: "Ռազմական կրթություն։ Մագիստրատուրա",
    list: [
      {
        info: "<strong>ՄԱԳԻՍՏՐԱՏՈՒՐԱ</strong> (բարձրագույն ռազմական կրթություն՝ ՀՀ ԶՈՒ ավագ սպայական կազմի համար)",
        listTitle: "Մասնագիտությունները՝",
        listItems: ["միավորումների և զորամասերի կառավարում,", "հրետանային միավորումների և զորամասերի կառավարում:"]
      },
      {
        listTitle: "Որակավորումը՝",
        listItems: ["Միավորումների և զորամասերի կառավարման մագիստրոս:", "Ուսման տևողությունը 11 ամիս է, անվճար:"]
      }
    ]
  },
  {
    title: "Կրթություն։ Բակալավրիատ",
    list: [
      {
        info: "Բակալավրիատ (բարձրագույն ռազմամասնագիտական կրթություն՝ հանրակրթական դպրոցների, վարժարանների շրջանավարտների համար) <br />",
        listTitle: "Մասնագիտությունները՝",
        listItems: [
          "մոտոհրաձգային ստորաբաժանումների կառավարում,",
          "հրետանային ստորաբաժանումների կառավարում,",
          "հետախուզական ստորաբաժանումների կառավարում,",
          "ինժեներասակրավորային ստորաբաժանումների կառավարում,",
          "տանկային ստորաբաժանումների կառավարում,",
          "հատուկ նշանակության ստորաբաժանումների կառավարում,",
          "ՀՀ ԱԱԾ սահմանապահ զորքերի ստորաբաժանումների կառավարում:"
        ]
      },
      {
        listTitle: "Որակավորումը՝",
        listItems: ["Ստորաբաժանումների կառավարման բակալավր:"],
        footer: "<strong>Ուսման տևողությունը</strong> 4 տարի է, անվճար:"
      }
    ]
  }
];

export const government: IMilEducation[] = [
  {
    title: "Ղեկավարություն",
    list: [
      {
        listType: "ordered",
        listItems: [
          "Ռազմական ակադեմիայի պետ,",
          "Ակադեմիայի պետի տեղակալ",
          "Ակադեմիայի պետի տեղակալ ուսումնական և գիտական աշխատանքների գծով",
          "Ակադեմիայի պետի տեղակալ բարոյահոգեբանական ապահովման գծով",
          "Ակադեմիայի պետի տեղակալ նյութատեխնիկական ապահովման գծով",
          "Ուսումնամեթոդական բաժին",
          "Գիտակազմակերպչական և կրթության որակի ապահովման բաժին",
          "Բարոյահոգեբանական ապահովման բաժանմունք",
          "Բուժծառայություն",
          "Շարային բաժանմունք",
          "Կադրերի բաժանմունք"
        ]
      }
    ]
  },
  {
    title: "Մարշալ Հ. Բաբաջանյանի անվան ցամաքային զորքերի ինստիտուտ",
    list: [
      {
        listType: "ordered",
        listItems: [
          "Գեներալ-գնդապետ Գ. Դալիբալթայանի անվան համազորային ֆակուլտետ",
          "Գեներալ-լեյտենանտ Ք. Իվանյանի անվան հրետանու ֆակուլտետ",
          "Հետախուզության ամբիոն",
          "Հատուկ զորքերի ամբիոն",
          "Կապի և ԱԿՀ ամբիոն"
        ]
      }
    ]
  },
  {
    title: "Մարշալ Ա. Խանփերյանցի անվան ռազմաօդային ուժերի ինստիտուտ",
    list: [
      {
        listType: "ordered",
        listItems: ["Ավիացիոն ֆակուլտետ", "Հակաօդային պաշտպանության ամբիոն", "Գիտահետազոտական և փորձարարական աշխատանքների բաժին"]
      }
    ]
  },
  {
    title: "Մարշալ Հ. Բաղրամյանի անվան հրամանատարաշտաբային ինստիտուտ",
    list: [
      {
        listType: "ordered",
        listItems: ["Օպերատիվ արվեստի և մարտավարության ամբիոն", "Զորատեսակների և հատուկ զորքերի կիրառման ամբիոն"]
      }
    ]
  },
  {
    title: "Առանձին ամբիոններ և կենտրոն",
    list: [
      {
        listType: "ordered",
        listItems: [
          "Գեներալ-գնդապետ Գ. Դալիբալթայանի անվան համազորային ֆակուլտետ",
          "Գեներալ-լեյտենանտ Ք. Իվանյանի անվան հրետանու ֆակուլտետ",
          "Հետախուզության ամբիոն",
          "Հատուկ զորքերի ամբիոն",
          "Կապի և ԱԿՀ ամբիոն",
          "Ավիացիոն ֆակուլտետ",
          "Հակաօդային պաշտպանության ամբիոն",
          "Գիտահետազոտական և փորձարարական աշխատանքների բաժին"
        ]
      }
    ]
  },
  {
    title: "Ուսումնական ստորաբաժանումներ",
    list: [
      {
        listType: "ordered",
        listItems: ["Սպաների որակավորման բարձրացման և ռազմամասնագիտական ուսուցման կենտրոն", "Կուրսանտական գումարտակներ:"]
      }
    ]
  }
];

export const education: IMilEducation[] = [
  {
    title: "Պատիվ ունեմ",
    content:
      "«Պատիվ ունեմ» ծրագրին ծանոթանալու համար, կարող եք ուսումնասիրել հետևյալ փաստաթուղթը։ <a download target='_blank' href='https://drive.google.com/file/d/1vVHBJuGPO8oGSr4nI_Uzh3RM_Cf41ba8/view?usp=sharing'>Պատիվ ունեմ</a>"
  },
  {
    title: "Կրթություն: Մեկամյա սպայական դասընթացներ՝ քաղաքացիական բուհերի շրջանավարտների համար",
    list: [
      {
        listTitle: "Մասնագիտությունները՝",
        listItems: ["մոտոհրաձգային ստորաբաժանումների կառավարում,", "հրետանային ստորաբաժանումների կառավարում"],
        footer: "<strong>Ուսման</strong> տևողությունը 1 տարի է, անվճար:"
      }
    ]
  },
  {
    title: "Հնգամյա Սպայական Դասեր",
    list: [
      {
        info: "Հինգամսյա սպայական դասընթացներ՝ բարձրագույն ուսումնական հաստատություններն ավարտած, զինված ուժերի ենթասպայական և պայմանագրային կազմի համար:",
        listTitle: "Մասնագիտությունները՝",
        listItems: [
          "մոտոհրաձգային ստորաբաժանումների կառավարում,",
          "հրետանային ստորաբաժանումների կառավարում,",
          "տանկային ստորաբաժանումների կառավարում:"
        ],
        footer: "<strong>Ուսման տևողությունը</strong> հինգ ամիս է, անվճար:"
      }
    ]
  }
];

export const applicant: IMilEducation[] = [
  {
    title: "Ընդունելության կարգ",
    content: `Մանրամասների համար կարող եք ուսումնասիրել հետևյալ փաստաթուղթը։ <a download target='_blank' href='https://drive.google.com/file/d/1ydNgE_ncpLEWbJOiFO6-MTzHZgFmxI65/view'>Դիմորդ</a>`
  },
  {
    title: "Մարշալ Հ. Բաբաջանյանի անվան ցամաքային զորքերի ինստիտուտ",
    list: [
      {
        listTitle: "Ուսման տևողությունը՝ 4 տարի",
        listItems: [
          " Մոտոհրաձգային ստորաբաժանումների կառավարում",
          "Հրետանային ստորաբաժանումների կառավարում",
          "Հետախուզական ստորաբաժանումների կառավարում",
          "Ինժեներասակրավորային ստորաբաժանումների կառավարում",
          "Տանկային ստորաբաժանումների կառավարում",
          "Հատուկ նշանակության ստորաբաժանումների կառավարում",
          "Սահմանապահ զորքերի ստորաբաժանումների կառավարում"
        ],
        listType: "ordered",
        footer: `
      <strong>Ընդունելության քննություններ</strong><br/>
      Դիմորդների հետ անցկացվում է ընդհանուր գիտելիքների և զարգացվածության աստիճանի թեստավորում կամ հանձնում են «Մաթեմատիկա» և «Ֆիզիկա» առարկաներից միասնական քննություններ:
      Ֆիզիկական պատրաստության քննություն, որն անցկացվում է Ռազմական ակադեմիայում:
      `
      }
    ]
  },
  {
    title: "Մարշալ Ա. Խանփերյանցի անվան ռազմաօդային ուժերի ինստիտուտ",
    list: [
      {
        listTitle: "Ուսման տևողությունը՝ 4 տարի",
        listItems: [
          "Թռչող ապարատների թռիչքային շահագործում (ինքնաթիռ)",
          "Թռչող ապարատների թռիչքային շահագործում (ուղղաթիռ)",
          "Անօդաչու թռչող սարքերի շահագործում և կիրառում",
          "ՀՕՊ մոտակա գործողության զենիթային համալիրներ"
        ],
        listType: "ordered"
      },
      {
        listTitle: "Ուսման տևողությունը՝ 5 տարի",
        listItems: [
          "Թռչող ապարատներ և շարժիչներ (ինքնաթիռ)",
          "Թռչող ապարատներ և շարժիչներ (ուղղաթիռ)",
          "Ավիացիոն սպառազինություն",
          "Թռչող ապարատների ավիացիոն սարքավորումներ",
          "Թռչող ապարատների ռադիոէլեկտրոնային սարքավորումներ",
          "Ռազմական կապի տեխնիկա",
          "ՀՕՊ միջին և փոքր հեռահարության զենիթային համալիրներ (Օսա-ԱԿ)",
          "ՀՕՊ միջին և փոքր հեռահարության զենիթային համալիրներ (Ս-300)",
          "ՀՕՊ ռադիոլոկացիոն համալիրներ"
        ],
        listType: "ordered",
        footer:
          "<strong>Ընդունելության քննություններ</strong><br/>Դիմորդների հետ անցկացվում է ընդհանուր գիտելիքների և զարգացվածության աստիճանի թեստավորում կամ հանձնում են «Մաթեմատիկա» և «Ֆիզիկա» առարկաներից միասնական քննություններ: Ֆիզիկական պատրաստության քննություն, որն անցկացվում է Ռազմական ակադեմիայում:"
      }
    ]
  },
  {
    title: "Մարշալ Հ. Բաղրամյանի անվան հրամանատարաշտաբային ինստիտուտ",
    list: [
      {
        listTitle: "Ուսման տևողությունը՝ 11 ամիս",
        listItems: ["Համազորային միավորումների և զորամասերի կառավարում", "Հրետանային միավորումների և զորամասերի կառավարում"],
        listType: "ordered"
      }
    ]
  }
];
