// types
import { StaticImageData } from "next/image";

// images
import NewsThumbnail from "@images/NewsThumbnail.png";
import AboutNews1 from "@images/AboutNews1.png";
import AboutNews2 from "@images/AboutNews2.png";
import AboutNews3 from "@images/AboutNews3.png";
import AboutNews4 from "@images/AboutNews4.png";
import MainPartImage from "@images/MainPartImage.png";

export interface IAboutNewsData {
  image1: StaticImageData;
  image2: StaticImageData;
}

export interface IMainPartData {
  image: StaticImageData;
  title: string;
  content: string;
  path: string;
}

interface List {
  info?: string;
  listTitle: string;
  listItems: string[];
  footer?: string;
}

export interface IMilEducation {
  title: string;
  content?: string;
  list?: List[];
}

export const AboutNewsData: IAboutNewsData[] = [
  {
    image1: AboutNews1,
    image2: AboutNews2
  },
  {
    image1: AboutNews4,
    image2: AboutNews3
  }
];

export const MainPartsData: IMainPartData[] = [
  {
    image: MainPartImage,
    title: "Մեր առօրյան",
    content: `- Սպորտ<br />
    - Մշակույթ և ժամանց <br />
    - Կացության պայմաններ`,
    path: "/ourDailyLife"
  },
  {
    image: MainPartImage,
    title: "Կրթություն",
    content: `- Ռազմական կրթություն <br />
		- Համալսարանական կրթություն <br />
		- Դիմորդ`,
    path: "/education"
  },
  {
    image: MainPartImage,
    title: "Մեր մասին",
    content: `-  Ուսումնական ծրագրեր </br>
    - Մասնաշենքեր </br>
    - Ապագայի պլանների և բարեփոխումների
    հատված`,
    path: "/about"
  }
];

export const milEducation: IMilEducation[] = [
  {
    title: "Կրթություն, հիմնական ինֆո",
    content: `<strong>ՀՀ ՊՆ Վ. Սարգսյանի</strong> անվան ռազմական համալսարանում կրթությունն իրականացվում է սպայական կազմի պատրաստման կրթության երկու փուլով և լրացուցիչ կրթության դասընթացներով:`
  },
  {
    title: "Հնգամյա Սպայական Դասեր",
    list: [
      {
        info: "Հինգամսյա սպայական դասընթացներ՝ բարձրագույն ուսումնական հաստատություններն ավարտած, զինված ուժերի ենթասպայական և պայմանագրային կազմի համար:",
        listTitle: "Մասնագիտությունները՝",
        listItems: [
          "մոտոհրաձգային ստորաբաժանումների կառավարում,",
          "հրետանային ստորաբաժանումների կառավարում,",
          "տանկային ստորաբաժանումների կառավարում:"
        ],
        footer: "<strong>Ուսման տևողությունը</strong> հինգ ամիս է, անվճար:"
      }
    ]
  },
  {
    title: "Մեկամյա սպայական դասընթացներ",
    list: [
      {
        info: "Մեկամյա սպայական դասընթացներ՝ քաղաքացիական բուհերի շրջանավարտների համար:",
        listTitle: "Մասնագիտությունները՝",
        listItems: ["մոտոհրաձգային ստորաբաժանումների կառավարում,", "հրետանային ստորաբաժանումների կառավարում,"],
        footer: "<strong>Ուսման տևողությունը</strong> 1 տարի է, անվճար:"
      }
    ]
  },
  {
    title: "Ռազմական կրթություն։ Մագիստրատուրա",
    list: [
      {
        info: "<strong>ՄԱԳԻՍՏՐԱՏՈՒՐԱ</strong> (բարձրագույն ռազմական կրթություն՝ ՀՀ ԶՈՒ ավագ սպայական կազմի համար) <br />",
        listTitle: "Մասնագիտությունները՝",
        listItems: ["միավորումների և զորամասերի կառավարում,", "հրետանային միավորումների և զորամասերի կառավարում:"]
      },
      {
        listTitle: "Որակավորումը՝",
        listItems: ["Միավորումների և զորամասերի կառավարման մագիստրոս:"],
        footer: " <strong>Ուսման տևողությունը՝</strong> 11 ամիս է, անվճար:"
      }
    ]
  },
  {
    title: "Ռազմական Կրթություն։ Լրացուցիչ ինֆորմացիա",
    content: `Համալսարանում ուսումնական գործընթացը պլանավորվում և իրականացվում է ուսումնամեթոդական բաժնի, <strong>երեք ֆակուլտետների և չորս</strong> առանձին ամբիոնների ուժերով՝
    հրամանատարաշտաբային ֆակուլտետ՝ միջազգային և ազգային անվտանգության ամբիոն, օպերատիվ արվեստի և մարտավարության  ամբիոն, զորատեսակների և հատուկ զորքերի կիրառման ամբիոն, համազորային ֆակուլտետ՝
    մարտավարության ամբիոն, զորատեսակների և ծառայությունների ամբիոն, կրակային պատրաստության ամբիոն, զրահատանկային ու ավտոմոբիլային տեխնիկայի ամբիոն, հրետանու ֆակուլտետ՝ հրաձգության և հրետանու կրակի կառավարման ամբիոն, հրետանու մարտավարության և մարտական կիրառման ամբիոն,
    սպառազինության և շահագործման ամբիոն, ստորաբաժանումների ամենօրյա ղեկավարման և ռազմաիրավական պատրաստության ամբիոն, ճշգրիտ առարկաների ամբիոն, հումանիտար առարկաների և լեզուների ամբիոն,
    ֆիզիկական պատրաստության և սպորտի ամբիոն: <br />
    Համազորային ֆակուլտետում իրականացվում է «Ստորաբաժանումների կառավարում» բակալավրի որակավորմամբ <strong>«Մոտոհրաձգային ստորա-բաժանումների կառավարում», «Հրետանային ստորաբաժանումների կառավարում», «Տանկային ստորաբաժանումների կառավարում», «Հետախուզական ստորաբաժանումների կառավարում» և «Ինժեներասակրավորային ստորաբաժանումների կառավարում»</strong> մասնագիտությամբ կրտսեր սպայական կազմի պատրաստումը: <br />
    Հրետանային ֆակուլտետում իրականացվում է «Ստորաբաժանումների կառավարում» բակալավրի որակավորմամբ «Հրետանային ստորաբաժանումների կառավարում» մասնագիտությամբ կրտսեր սպայական կազմի պատրաստումը:
    Հրամանատարաշտաբային ֆակուլտետում իրականացվում է «Միավորումների, զորամասերի կառավարում» մագիստրոսի որակավորմամբ «Միավորումների, զորամասերի կառավարում» և «Հրետանային միավորումների, զորամասերի կառավարում» մասնագիտությամբ ավագ սպայական կազմի պատրաստումը:
    Ֆիզիկական պատրաստության և սպորտի, հումանիտար առարկաների և լեզուների, ճշգրիտ առարկաների, ստորաբաժանումների ամենօրյա ղեկավարման և ռազմաիրավական պատրաստության առանձին ամբիոնների ուժերով անցկացվում է
    ֆիզիկական պատրաստության, լեզուների, ընդհանուր գիտական և ինժեներատեխնիկական և հասարակագիտական առարկաների  դասավանդումը: <br />
    Ռազմական համալսարանն ունի չորս գրադարան, որոնցից երկուսը՝ էլեկտրոնային, սպորտդահլիճ, թանգարան, բուժկետ: Կուրսանտների և ունկնդիրների, ինչպես նաև նրանց ընտանիքների անդամների համար  պարբերաբար կազմակերպվում են այցելություններ ՀՀ մշակութային օջախներ: Սննդի կազմակերպումն իրականացվում է սահմանափակ պատաս-խանատվությամբ ընկերության կողմից, որի արդյունքում գրանցվել է սննդի պատրաստման և մատուցման որակի բարելավում: <br />
    Համալսարանի կուրսանտներն ապահովվում են ամենամյա արձակուրդով, անվճար սննդով, հանդերձանքով և կացարանով:
    Կուրսանտներին տրամադրվում է կրթաթոշակ, իսկ գերազանց առաջադիմությամբ սովորող և զինվորական բարձր կարգապահություն ունեցող կուրսանտներն ստանում են անվանական պարգևավճարներ:
    «ՀՀ զինվորական ծառայության և զինծառայողի կարգավիճակի մասին» Հայաստանի Հանրապետության օրենքի համաձայն՝ կուրսանտներին և իրենց ընտանիքի անդամներին տրամադրվում է անվճար բուժօգնություն:
    Ուսման ընթացքում Ռազմական համալսարանի կուրսանտները ստանում են որակյալ բարձրագույն կրթություն, հնարավորություն են ունենում ուսումը շարունակել արտերկրի բարձրագույն ռազմաուսումնական հաստա-տություններում, մասնակցել հանրապետական ու միջազգային ռազմամարզական սպարտակիադաների, գիտական կոնֆերանսների ու օլիմպիադաների, մշակութային և ուսանողական տարատեսակ միջոցառումների, անվճար սովորել օտար լեզուներ, մարզվել սպորտային խմբակներում, օգտվել միջազգային գրականությունից և տարատեսակ ուսումնական նյութերից: <br />
    Ռազմական համալսարանի շրջանավարտներն ապահովվում են ՀՀ զինված ուժերում կայուն և երկարաժամկետ աշխատանքով և ֆինանսական կայունությամբ:
    Ռազմական համալսարանի շրջանավարտները հնարավորություն ունեն հետագայում բարձրացնել իրենց մասնագիտական որակավորումները և կրթական մակարդակը ՀՀ և արտերկրի ռազմաուսումնական հաստատություններում:
    Համալսարանի շրջանավարտներն օգտվում են «ՀՀ զինվորական ծառայության և զինծառայողի կարգավիճակի մասին» Հայաստանի Հանրապետության օրենքով սահմանված զինծառայողների և նրանց ընտանիքի անդամներին տրվող սոցիալական ապահովման արտոնություններից՝ ծառայողական բնակարանային ապահովում, մատչելի հիպոտեկով բնակարանի ձեռքբերման հնարավորություն, անվճար բուժօգնություն (այդ թվում՝ իրենց ընտանիքի անդամները), առողջարանային հանգիստ, անվճար տրանսպորտային սպասարկում, երկարամա ծառայության կենսաթոշակ:`
  },
  {
    title: "Ռազմական կրթություն։ Մագիստրատուրա",
    list: [
      {
        info: "<strong>ՄԱԳԻՍՏՐԱՏՈՒՐԱ</strong> (բարձրագույն ռազմական կրթություն՝ ՀՀ ԶՈՒ ավագ սպայական կազմի համար)",
        listTitle: "Մասնագիտությունները՝",
        listItems: ["միավորումների և զորամասերի կառավարում,", "հրետանային միավորումների և զորամասերի կառավարում:"]
      },
      {
        listTitle: "Որակավորումը՝",
        listItems: ["Միավորումների և զորամասերի կառավարման մագիստրոս:", "Ուսման տևողությունը 11 ամիս է, անվճար:"]
      }
    ]
  },
  {
    title: "Կրթություն։ Բակալավրիատ",
    list: [
      {
        info: "Բակալավրիատ (բարձրագույն ռազմամասնագիտական կրթություն՝ հանրակրթական դպրոցների, վարժարանների շրջանավարտների համար) <br />",
        listTitle: "Մասնագիտությունները՝",
        listItems: [
          "մոտոհրաձգային ստորաբաժանումների կառավարում,",
          "հրետանային ստորաբաժանումների կառավարում,",
          "հետախուզական ստորաբաժանումների կառավարում,",
          "ինժեներասակրավորային ստորաբաժանումների կառավարում,",
          "տանկային ստորաբաժանումների կառավարում,",
          "հատուկ նշանակության ստորաբաժանումների կառավարում,",
          "ՀՀ ԱԱԾ սահմանապահ զորքերի ստորաբաժանումների կառավարում:"
        ]
      },
      {
        listTitle: "Որակավորումը՝",
        listItems: ["Ստորաբաժանումների կառավարման բակալավր:"],
        footer: "<strong>Ուսման տևողությունը</strong> 4 տարի է, անվճար:"
      }
    ]
  }
];

export const education: IMilEducation[] = [
  {
    title: "Կրթություն: «Պատիվ ունեմ»",
    content: `«Պատիվ ունեմ» ծրագրի գաղափարախոսությունն է՝ բուհական տարկետումը կապել ապագա սպայական ծառայության հետ... <br />
      «Պատիվ ունեմ» ծրագրի գաղափարախոսությունն է՝ բուհական տարկետումը կապել ապագա սպայական ծառայության հետ:<br />
      Ծրագրի մասնակիցներին տրվում է պարտադիր զինվորական ծառայության զորակոչից տարկետման իրավունք, ուսումնառությունը բարձրագույն ուսումնական հաստատություններում իրականացվում է պետության կողմից ուսանողական նպաստների ձևով ուսման վարձի լրիվ փոխհատուցմամբ, բարձրագույն ուսումնական հաստատության կողմից համապատասխան մասնագիտության համար սահմանված տարեկան վարձի չափով:
      ԲՈւՀ-ը և զինվորական պատրաստությունը սահմանված կարգով ավարտելուց հետո զորակոչված քաղաքացուն շնորհվում է լեյտենանտ զինվորական կոչում, նրա հետ կնքվում է կրտսեր սպայական կազմի պայմանագրային ծառայություն անցնելու մասին պայմանագիր և վիճակահանությամբ նշանակվում ծառայության. <br />
      - դասակի հրամանատարների պաշտոնների համալրման պատրաստության դեպքում՝ 2 տարի 3 ամիս ժամկետով, որում առաջին 3 ամիսը՝ շարքային կազմի պարտադիր զինծառայողի կարգավիճակով, <br />
      - բժշկական մասնագիտացում պահանջող պաշտոնների համալրման պատրաստության դեպքում՝ ուսումնառության և 1 տարի ժամկետով կլինիկական ռեզիդենտուրայում Հայաստանի Հանրապետության պաշտպանության նախարարության պատվերով ուսումնառության ավարտից հետո՝ 4 տարի ժամկետով: <br />
      «Պատիվ ունեմ» ծրագիրը կարգավորվում է ՀՀ կառավարության 2018թ. ապրիլի 12-ի N430-Ն և N455-Ն որոշումներով, որտեղ հստակ նշված են այն բոլոր ընթացակարգերը, որը անհրաժեշտ է ծրագրի մասնակից դառնալու համար:
      Լրացուցիչ տեղեկությունների և պարզաբանումների համար գործում են հետևյալ հեռախոսահամարները. <br />
      <strong>1-28 ՀՀ ՊՆ թեժ գիծ</strong> <br /> 
      <strong>010-29-45-84, ՀՀ ՊՆ կադրային և ռազմակրթական քաղաքականության գլխավոր վարչություն</strong>`
  },
  {
    title: "Կրթություն: Մեկամյա սպայական դասընթացներ՝ քաղաքացիական բուհերի շրջանավարտների համար",
    list: [
      {
        listTitle: "Մասնագիտությունները՝",
        listItems: ["մոտոհրաձգային ստորաբաժանումների կառավարում,", "հրետանային ստորաբաժանումների կառավարում"],
        footer: "<strong>Ուսման</strong> տևողությունը 1 տարի է, անվճար:"
      }
    ]
  },
  {
    title: "Հնգամյա Սպայական Դասեր",
    list: [
      {
        info: "Հինգամսյա սպայական դասընթացներ՝ բարձրագույն ուսումնական հաստատություններն ավարտած, զինված ուժերի ենթասպայական և պայմանագրային կազմի համար:",
        listTitle: "Մասնագիտությունները՝",
        listItems: [
          "մոտոհրաձգային ստորաբաժանումների կառավարում,",
          "հրետանային ստորաբաժանումների կառավարում,",
          "տանկային ստորաբաժանումների կառավարում:"
        ],
        footer: "<strong>Ուսման տևողությունը</strong> հինգ ամիս է, անվճար:"
      }
    ]
  }
];
